{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "batch_input_shape": [null, 128], "dtype": "float32", "units": 16384, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [1024, 4, 4]}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_14", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_transpose_13", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_13", "trainable": true, "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_13", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_15", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_transpose_14", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_14", "trainable": true, "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_14", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["conv2d_21", 0, 0, {}], ["conv2d_22", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_16", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_transpose_15", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_15", "trainable": true, "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_15", 0, 0, {}]]]}, {"name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_17", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]]}, {"name": "conv2d_transpose_16", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_16", "trainable": true, "filters": 1024, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_16", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["conv2d_24", 0, 0, {}], ["conv2d_25", 0, 0, {}]]]}, {"name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_18", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]]}, {"name": "conv2d_transpose_17", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_17", "trainable": true, "filters": 512, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_17", 0, 0, {}]]]}, {"name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_19", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "conv2d_transpose_18", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_18", "trainable": true, "filters": 512, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_18", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["conv2d_27", 0, 0, {}], ["conv2d_28", 0, 0, {}]]]}, {"name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_20", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]]}, {"name": "conv2d_transpose_19", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_19", "trainable": true, "filters": 256, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_19", 0, 0, {}]]]}, {"name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_21", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]]}, {"name": "conv2d_transpose_20", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_20", "trainable": true, "filters": 256, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_20", 0, 0, {}]]]}, {"name": "add_10", "class_name": "Add", "config": {"name": "add_10", "trainable": true}, "inbound_nodes": [[["conv2d_30", 0, 0, {}], ["conv2d_31", 0, 0, {}]]]}, {"name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_22", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]]}, {"name": "conv2d_transpose_21", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_21", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_21", 0, 0, {}]]]}, {"name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_23", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]]}, {"name": "conv2d_transpose_22", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_22", "trainable": true, "filters": 128, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_10", 0, 0, {}]]]}, {"name": "conv2d_33", "class_name": "Conv2D", "config": {"name": "conv2d_33", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "conv2d_34", "class_name": "Conv2D", "config": {"name": "conv2d_34", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_22", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true}, "inbound_nodes": [[["conv2d_33", 0, 0, {}], ["conv2d_34", 0, 0, {}]]]}, {"name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_24", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]]}, {"name": "conv2d_transpose_23", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_23", "trainable": true, "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "conv2d_35", "class_name": "Conv2D", "config": {"name": "conv2d_35", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_23", 0, 0, {}]]]}, {"name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_25", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_35", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]]}, {"name": "conv2d_transpose_24", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_24", "trainable": true, "filters": 64, "kernel_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "conv2d_36", "class_name": "Conv2D", "config": {"name": "conv2d_36", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"name": "conv2d_37", "class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2d_transpose_24", 0, 0, {}]]]}, {"name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true}, "inbound_nodes": [[["conv2d_36", 0, 0, {}], ["conv2d_37", 0, 0, {}]]]}, {"name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_26", "trainable": true, "axis": 1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"name": "activation_27", "class_name": "Activation", "config": {"name": "activation_27", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "filters": 3, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_first", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"name": "activation_28", "class_name": "Activation", "config": {"name": "activation_28", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["activation_28", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of63.bin", "group1-shard2of63.bin", "group1-shard3of63.bin", "group1-shard4of63.bin", "group1-shard5of63.bin", "group1-shard6of63.bin", "group1-shard7of63.bin", "group1-shard8of63.bin", "group1-shard9of63.bin", "group1-shard10of63.bin", "group1-shard11of63.bin", "group1-shard12of63.bin", "group1-shard13of63.bin", "group1-shard14of63.bin", "group1-shard15of63.bin", "group1-shard16of63.bin", "group1-shard17of63.bin", "group1-shard18of63.bin", "group1-shard19of63.bin", "group1-shard20of63.bin", "group1-shard21of63.bin", "group1-shard22of63.bin", "group1-shard23of63.bin", "group1-shard24of63.bin", "group1-shard25of63.bin", "group1-shard26of63.bin", "group1-shard27of63.bin", "group1-shard28of63.bin", "group1-shard29of63.bin", "group1-shard30of63.bin", "group1-shard31of63.bin", "group1-shard32of63.bin", "group1-shard33of63.bin", "group1-shard34of63.bin", "group1-shard35of63.bin", "group1-shard36of63.bin", "group1-shard37of63.bin", "group1-shard38of63.bin", "group1-shard39of63.bin", "group1-shard40of63.bin", "group1-shard41of63.bin", "group1-shard42of63.bin", "group1-shard43of63.bin", "group1-shard44of63.bin", "group1-shard45of63.bin", "group1-shard46of63.bin", "group1-shard47of63.bin", "group1-shard48of63.bin", "group1-shard49of63.bin", "group1-shard50of63.bin", "group1-shard51of63.bin", "group1-shard52of63.bin", "group1-shard53of63.bin", "group1-shard54of63.bin", "group1-shard55of63.bin", "group1-shard56of63.bin", "group1-shard57of63.bin", "group1-shard58of63.bin", "group1-shard59of63.bin", "group1-shard60of63.bin", "group1-shard61of63.bin", "group1-shard62of63.bin", "group1-shard63of63.bin"], "weights": [{"name": "batch_normalization_14/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_15/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_16/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_17/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_18/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_19/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_19/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_20/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_21/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_21/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_22/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_22/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_22/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_22/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_23/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_23/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_24/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_24/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_24/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_24/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_25/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_25/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_25/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_25/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_26/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_26/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_26/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_26/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "conv2d_20/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_20/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_21/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_22/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_23/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_24/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_25/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "conv2d_25/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_26/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_26/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_27/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_27/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_28/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "conv2d_28/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_29/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_29/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_30/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_30/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_31/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "conv2d_31/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_32/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_32/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_33/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_33/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_34/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "conv2d_34/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_35/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_35/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_36/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "conv2d_36/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_37/kernel", "shape": [3, 3, 64, 32], "dtype": "float32"}, {"name": "conv2d_37/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_38/kernel", "shape": [3, 3, 32, 3], "dtype": "float32"}, {"name": "conv2d_38/bias", "shape": [3], "dtype": "float32"}, {"name": "conv2d_transpose_13/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_13/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_14/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_14/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_15/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_15/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_16/kernel", "shape": [2, 2, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_transpose_16/bias", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_transpose_17/kernel", "shape": [2, 2, 512, 512], "dtype": "float32"}, {"name": "conv2d_transpose_17/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_18/kernel", "shape": [2, 2, 512, 512], "dtype": "float32"}, {"name": "conv2d_transpose_18/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_transpose_19/kernel", "shape": [2, 2, 256, 256], "dtype": "float32"}, {"name": "conv2d_transpose_19/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_20/kernel", "shape": [2, 2, 256, 256], "dtype": "float32"}, {"name": "conv2d_transpose_20/bias", "shape": [256], "dtype": "float32"}, {"name": "conv2d_transpose_21/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_21/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_22/kernel", "shape": [2, 2, 128, 128], "dtype": "float32"}, {"name": "conv2d_transpose_22/bias", "shape": [128], "dtype": "float32"}, {"name": "conv2d_transpose_23/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_23/bias", "shape": [64], "dtype": "float32"}, {"name": "conv2d_transpose_24/kernel", "shape": [2, 2, 64, 64], "dtype": "float32"}, {"name": "conv2d_transpose_24/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [128, 16384], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [16384], "dtype": "float32"}]}]}